[
  [
    "Urho Vaakanainen",
    "Oct 10",
    "Injured Reserve",
    "Vaakanainen (undisclosed) was placed on injured reserve Sunday, per CapFriendly."
  ],
  [
    "John Gibson",
    "Oct 8",
    "Day-To-Day",
    "Gibson left Saturday's preseason game because of an upper-body injury."
  ],
  [
    "John Moore",
    "Sep 21",
    "Injured Reserve",
    "Moore will not be in training camp due to a lingering undisclosed injury, the team announced Wednesday. Additionally, the blueliner was designated for injured reserve according to the team's training camp roster."
  ],
  [
    "Jakob Chychrun",
    "Oct 10",
    "Injured Reserve",
    "Chychrun (wrist) was placed on injured reserve Monday."
  ],
  [
    "Clayton Keller",
    "Oct 8",
    "Day-To-Day",
    "The Coyotes held Keller (leg) out of Friday's preseason game against Vancouver for precautionary reasons, Craig Morgan of PHNX Sports reports."
  ],
  [
    "Matt Grzelcyk",
    "Oct 7",
    "Injured Reserve",
    "Grzelcyk (shoulder) participated in a full practice Friday, according to Joe Haggerty."
  ],
  [
    "Mason Lohrei",
    "Sep 15",
    "Day-To-Day",
    ""
  ],
  [
    "Brett Harrison",
    "Sep 13",
    "Out",
    "Harrison will not be available for training camp due to an undisclosed injury, Joe Haggerty of BostonHockeyNow.com reports Tuesday."
  ],
  [
    "Riley Sheahan",
    "Oct 10",
    "Injured Reserve",
    "Sheahan (undisclosed) is expected to begin the season on injured reserve, Lance Lysowski of The Buffalo News reports."
  ],
  [
    "Olivier Nadeau",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Max Pacioretty",
    "Oct 10",
    "Injured Reserve",
    "Pacioretty (Achilles surgery) was moved to the iinjured non-roster list Monday by the Hurricanes."
  ],
  [
    "Cavan Fitzgerald",
    "Oct 5",
    "Injured Reserve",
    "Fitzgerald (undisclosed) was placed on non-roster injured reserve Wednesday, Walt Ruff of the Hurricanes' official site reports."
  ],
  [
    "Jake McCabe",
    "Oct 7",
    "Injured Reserve",
    "McCabe (neck) took part in a full practice Friday, according to Tracey Myers of NHL.com."
  ],
  [
    "Jalen Luypen",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Jacob Macdonald",
    "Oct 10",
    "Injured Reserve",
    ""
  ],
  [
    "Nathan MacKinnon",
    "Oct 8",
    "Day-To-Day",
    "MacKinnon left Saturday's practice after tweaking something, Peter Baugh of The Athletic reports."
  ],
  [
    "J.T. Compher",
    "Oct 6",
    "Day-To-Day",
    "Compher (undisclosed) should be ready when the regular season begins next Wednesday against Chicago, Adrian Dater of Colorado Hockey Now reports."
  ],
  [
    "Gabriel Landeskog",
    "Oct 2",
    "Injured Reserve",
    "Landeskog (lower body) is doing off-ice workouts but has not yet resumed skating, Brennan Vogt of Colorado Hockey Now reports."
  ],
  [
    "Joonas Korpisalo",
    "Oct 10",
    "Injured Reserve",
    ""
  ],
  [
    "Erik Gudbranson",
    "Oct 8",
    "Day-To-Day",
    "Gudbranson (lower body) will not play Saturday against the Capitals. Aaron Portzline of The Athletic reports."
  ],
  [
    "Gustav Nyquist",
    "Oct 8",
    "Day-To-Day",
    "Nyquist (lower body) is back at practice Saturday, Blue Jackets team reporter Jeff Svoboda reports."
  ],
  [
    "Alexandre Texier",
    "Aug 25",
    "Out",
    ""
  ],
  [
    "Seth Barton",
    "Oct 10",
    "Injured Reserve",
    "Barton (undisclosed) was placed on injured reserve Monday, per CapFriendly."
  ],
  [
    "Jake Walman",
    "Oct 9",
    "Injured Reserve",
    "Walman (shoulder) remains on track to return in November, Ansar Khan of MLive.com reports."
  ],
  [
    "Robby Fabbri",
    "Sep 21",
    "Injured Reserve",
    "Fabbri (knee) will not be ready to play until the calendar turns to 2023, Max Bultman of The Athletic reports Wednesday."
  ],
  [
    "Kailer Yamamoto",
    "Oct 10",
    "Day-To-Day",
    "Yamamoto (undisclosed) practiced Monday, but his status remains unclear for Wednesday's season opener versus Vancouver, Daniel Nugent-Bowman of The Athletic reports."
  ],
  [
    "Carter Savoie",
    "Sep 23",
    "Out",
    ""
  ],
  [
    "Raphael Lavoie",
    "Sep 23",
    "Out",
    ""
  ],
  [
    "Pavel Novak",
    "Oct 5",
    "Injured Reserve",
    "Novak (illness) announced Wednesday he has beaten cancer."
  ],
  [
    "Jon Merrill",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Jordan Greenway",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Joel Edmundson",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Tyce Thompson",
    "Oct 10",
    "Injured Reserve",
    "Thompson (lower body) will begin the 2022-23 season on injured reserve."
  ],
  [
    "Oliver Wahlstrom",
    "Oct 10",
    "Day-To-Day",
    "Wahlstrom (upper body) expects to be ready for the Islanders' season opener on Thursday against Florida, Kevin Kurz of The Athletic reports."
  ],
  [
    "Sammy Blais",
    "Oct 10",
    "Day-To-Day",
    "Blais (upper body) is doubtful to play in Tuesday's season opener against Tampa Bay, Mollie Walker of the New York Post reports."
  ],
  [
    "Artyom  Zub",
    "Oct 10",
    "Day-To-Day",
    "Zub (undisclosed) didn't practice Monday because of a minor injury, TSN 1200 Ottawa reports."
  ],
  [
    "Joel Farabee",
    "Oct 7",
    "Day-To-Day",
    "Farabee (neck) has been cleared by doctors for full contact, reports Sam Carchidi of Philly Hockey Now."
  ],
  [
    "Sean Couturier",
    "Sep 28",
    "Injured Reserve",
    "Couturier (back) will not require surgery but is still considered week-to-week, Bill Meltzer of NHL.com reports Wednesday."
  ],
  [
    "Artem Anisimov",
    "Sep 25",
    "Day-To-Day",
    "Anisimov didn't take part in Sunday's scrimmage due to a lower-body injury, Bill Meltzer of the Flyers' official site reports."
  ],
  [
    "Bobby Brink",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Ryan Ellis",
    "Sep 22",
    "Injured Reserve",
    "Ellis (back) is expected to miss the entirety of the 2022-23 campaign with what could be a career-threatening injury, NHL.com's Adam Kimelman reports."
  ],
  [
    "Teddy Blueger",
    "Oct 7",
    "Day-To-Day",
    "Blueger (upper body) practiced with the Penguins in a non-contact jersey, according to Pens Inside Scoop."
  ],
  [
    "Nikolai Knyzhov",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Joonas Donskoi",
    "Oct 9",
    "Injured Reserve",
    "Donskoi (upper body) was placed on injured reserve Sunday, per CapFriendly."
  ],
  [
    "Jaden Schwartz",
    "Oct 8",
    "Day-To-Day",
    "Schwartz is listed as day-to-day with a lower-body injury, Kraken radio announcer Mike Benton reports."
  ],
  [
    "Ryan Winterton",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Chris Driedger",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Marco Scandella",
    "Oct 8",
    "Injured Reserve",
    "IR-LT"
  ],
  [
    "Tyler Pitlick",
    "Oct 4",
    "Day-To-Day",
    "Pitlick won't be available to play Tuesday because of an upper-body injury, Lou Korac of NHL.com reports."
  ],
  [
    "Anthony Angello",
    "Oct 1",
    "Day-To-Day",
    "Angello is in the concussion protocol following his early exit from Saturday's game versus the Stars, Lou Korac of NHL.com reports."
  ],
  [
    "Keean Washkurak",
    "Sep 26",
    "Injured Reserve",
    "Washkurak will undergo wrist surgery Monday that will sideline him for 4-6 weeks."
  ],
  [
    "Alexey Toropchenko",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Mikhail Sergachev",
    "Oct 7",
    "Day-To-Day",
    "Sergachev (undisclosed) will be held out of Friday's preseason game."
  ],
  [
    "Anthony Cirelli",
    "Sep 23",
    "Injured Reserve",
    "Cirelli (shoulder) was on the ice Thursday at training camp working on skills, reports the Tampa Bay Times."
  ],
  [
    "Zach Bogosian",
    "Sep 23",
    "Injured Reserve",
    "Bogosian (shoulder) is on the ice at training camp in a red non-contact jersey, reports Tampa Bay Times."
  ],
  [
    "Brayden Point",
    "Sep 15",
    "Day-To-Day",
    ""
  ],
  [
    "John Tavares",
    "Oct 10",
    "Out",
    "Tavares (oblique) hasn't been ruled out yet for Wednesday's season opener against Montreal, Mark Masters of TSN.careports."
  ],
  [
    "Carl Dahlstrom",
    "Oct 5",
    "Injured Reserve",
    ""
  ],
  [
    "Rodion Amirov",
    "Sep 15",
    "Day-To-Day",
    ""
  ],
  [
    "Joseph Woll",
    "Sep 15",
    "Day-To-Day",
    ""
  ],
  [
    "Brock Boeser",
    "Oct 9",
    "Out",
    "Head coach Bruce Boudreau is \"hopeful\" that Boeser (hand) can play Wednesday in Edmonton, Harman Dayal of The Athletic reports."
  ],
  [
    "Conor Garland",
    "Oct 8",
    "Day-To-Day",
    "Garland (undisclosed) will not return to Friday's preseason tilt with Arizona."
  ],
  [
    "William Carrier",
    "Oct 4",
    "Day-To-Day",
    ""
  ],
  [
    "Robin Lehner",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "T.J. Oshie",
    "Oct 9",
    "Day-To-Day",
    "Oshie (upper body) feels good to go, but he needs to be medically cleared first to play on Opening Night, Samantha Pell of The Washington Post reports."
  ],
  [
    "Lars Eller",
    "Oct 8",
    "Day-To-Day",
    ""
  ],
  [
    "Alexander Alexeyev",
    "Sep 24",
    "Injured Reserve",
    ""
  ],
  [
    "Pierre-Luc Dubois",
    "Oct 8",
    "Day-To-Day",
    "Winnipeg was \"being careful\" with Dubois' minor lower-body injury Friday, Mike McIntyre of the Winnipeg Free Press reports."
  ],
  [
    "Mason Appleton",
    "Oct 7",
    "Day-To-Day",
    "Appleton is not at practice on Friday due to an upper-body injury, Scott Billeck of the Winnipeg Sun reports."
  ]
]